<a href="https://colab.research.google.com/github/aditya248/Netflix-Exploratory-Data-Analysis/blob/main/BA775_TeamProject_B2T8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#BA775 - Team Project - Team 8
##*Project Proposal*

###**Summary Research for Netflix on it’s library**

Our mission is to help Netflix summarize the details of their movie and TV show library to help them see trends on how their library has changed. We will also summarize Netflix materials based on popular genres and actors to compare with highest earning  and popular entertainment types so Netflix can maximize their user amount. 

**Source:**
https://www.kaggle.com/shivamb/netflix-sh

In [2]:
from google.colab import auth
auth.authenticate_user()

##**Part 1 -** Overview of Netflix Library

In [ ]:
##Movie Show Count

In [ ]:
%%bigquery --project=ba775-team8-b2
SELECT 
    
    COUNT(CASE WHEN type = 'Movie'
    THEN show_id END) AS movie_totals,
    COUNT(CASE WHEN type = 'TV Show' 
    THEN show_id END) AS tv_show_totals,
    COUNT(type) as total_library
 FROM `ba775-team8-b2.Netflix.netflix_titles`

In [ ]:
## Average duration of movie and TV shows -Hanyu

In [ ]:
%%bigquery --project=ba775-team8-b2
SELECT type,AVG(new_duration) AS average_duration FROM
(SELECT type,CAST(REPLACE(REPLACE(REPLACE(duration,'min',''),'Season',''),'s','') AS INT64) AS new_duration
FROM `ba775-team8-b2.Netflix.netflix_titles`)
GROUP BY type

      type  average_duration
0    Movie         99.307978
1  TV Show          1.775934

In [ ]:
## Overview of Rating-Hanyu

In [9]:
%%bigquery --project=ba775-team8-b2
SELECT DISTINCT rating as Type_Of_Ratings FROM `ba775-team8-b2.Netflix.netflix_titles` WHERE rating IS NOT NULL
#Different type of ratings.

   Type_Of_Ratings
0                G
1                R
2               NR
3               PG
4               UR
5             TV-G
6             TV-Y
7            NC-17
8            PG-13
9            TV-14
10           TV-MA
11           TV-PG
12           TV-Y7
13        TV-Y7-FV

In [11]:
%%bigquery --project=ba775-team8-b2
SELECT rating as Type_Of_Rating, COUNT(*) as Total_Content 
FROM `ba775-team8-b2.Netflix.netflix_titles` 
WHERE rating IS NOT NULL
GROUP BY rating
ORDER BY Total_Content DESC
#Rating for both TV and movies

   Type_Of_Rating  Total_Content
0           TV-MA           2863
1           TV-14           1931
2           TV-PG            806
3               R            665
4           PG-13            386
5            TV-Y            280
6           TV-Y7            271
7              PG            247
8            TV-G            194
9              NR             84
10              G             39
11       TV-Y7-FV              6
12             UR              5
13          NC-17              3

In [ ]:
%%bigquery --project=ba775-team8-b2
#For TV show
SELECT rating, COUNT(rating) AS count_rating FROM `ba775-team8-b2.Netflix.netflix_titles`
WHERE type='TV Show' AND rating IS NOT NULL
GROUP BY rating
ORDER BY 2 DESC

     rating  count_rating
0     TV-MA          1018
1     TV-14           659
2     TV-PG           301
3     TV-Y7           176
4      TV-Y           163
5      TV-G            83
6        NR             5
7         R             2
8  TV-Y7-FV             1

In [ ]:
%%bigquery --project=ba775-team8-b2
SELECT rating, COUNT(rating) AS count_rating FROM `ba775-team8-b2.Netflix.netflix_titles`
WHERE type='Movie' AND rating IS NOT NULL
GROUP BY rating
ORDER BY 2 DESC

      rating  count_rating
0      TV-MA          1845
1      TV-14          1272
2          R           663
3      TV-PG           505
4      PG-13           386
5         PG           247
6       TV-Y           117
7       TV-G           111
8      TV-Y7            95
9         NR            79
10         G            39
11        UR             5
12  TV-Y7-FV             5
13     NC-17             3

In [ ]:
## Movies/TV shows Released by Year -Hanyu

In [ ]:
%%bigquery --project=ba775-team8-b2
SELECT release_year, COUNT(release_year) AS movie_added FROM `ba775-team8-b2.Netflix.netflix_titles`
GROUP BY release_year
ORDER BY movie_added DESC

    release_year  movie_added
0           2018         1121
1           2017         1012
2           2019          996
3           2016          882
4           2020          868
..           ...          ...
68          1925            1
69          1959            1
70          1964            1
71          1947            1
72          1966            1

[73 rows x 2 columns]

In [ ]:
## Popular Directors in Netflix -Hanyu

In [ ]:
%%bigquery --project=ba775-team8-b2
SELECT director, COUNT(director) AS time_appeared
FROM `ba775-team8-b2.Netflix.netflix_titles`
WHERE director IS NOT NULL
GROUP BY 1
ORDER BY 2 DESC

                        director  time_appeared
0         Raúl Campos, Jan Suter             18
1                   Marcus Raboy             16
2                      Jay Karas             14
3            Cathy Garcia-Molina             13
4                Martin Scorsese             12
...                          ...            ...
4044     Max Lang, Jani Lachauer              1
4045  Joe Murray, Cosmo Segurson              1
4046               Joel Crawford              1
4047                 Mario Cambi              1
4048                 Suhas Kadav              1

[4049 rows x 2 columns]

In [ ]:
#production breakdown by country -- left null in as netflix should find better way to group so much content coming form

In [ ]:
%%bigquery --project=ba775-team8-b2
SELECT 
    country,
    COUNT(CASE WHEN type = 'Movie'
    THEN show_id END) AS movie_totals,
    COUNT(CASE WHEN type = 'TV Show' 
    THEN show_id END) AS tv_show_totals,
    COUNT(type) as total_content_prodcution
 FROM `ba775-team8-b2.Netflix.netflix_titles` 
 GROUP BY country
 ORDER BY total_content_prodcution DESC
 LIMIT 20;

                          country  ...  total_content_prodcution
0                   United States  ...                      2555
1                           India  ...                       923
2                            None  ...                       507
3                  United Kingdom  ...                       397
4                           Japan  ...                       226
5                     South Korea  ...                       183
6                          Canada  ...                       177
7                           Spain  ...                       134
8                          France  ...                       115
9                           Egypt  ...                       101
10                         Turkey  ...                       100
11                         Mexico  ...                       100
12                      Australia  ...                        83
13                         Taiwan  ...                        78
14                         Brazil  ...                        72
15                    Philippines  ...                        71
16                      Indonesia  ...                        70
17                        Nigeria  ...                        70
18  United Kingdom, United States  ...                        64
19                        Germany  ...                        61

[20 rows x 4 columns]

##**Part 2 -** Netflix Movies

In [ ]:
## INNER JOIN two dataset and find out the top 10 rating movies

In [ ]:
%%bigquery --project=ba775-team8-b2
SELECT n.title, n.director, n.country, n.date_added, r.Rating
FROM `ba775-team8-b2.Netflix.netflix_titles` as n
INNER JOIN `ba775-team8-b2.Netflix.IMBd_movies_ratings` as r
   ON lower(n.title) = lower(r.title)
ORDER BY r.Rating DESC
LIMIT 10

                  title  ... Rating
0             Inception  ...    8.8
1                Dangal  ...    8.8
2      The Intouchables  ...    8.6
3      Taare Zameen Par  ...    8.5
4          The Departed  ...    8.5
5   The Lives of Others  ...    8.5
6              3 Idiots  ...    8.4
7      Django Unchained  ...    8.4
8  Inglourious Basterds  ...    8.3
9        Paint It Black  ...    8.3

[10 rows x 5 columns]

INNER JOIN two dataset and find out the highest grossing movie

In [ ]:
%%bigquery --project=ba775-team8-b2
SELECT n.title, n.director, n.country, n.date_added, r.Rating, r.Revenue__Millions_
FROM `ba775-team8-b2.Netflix.netflix_titles` as n
INNER JOIN `ba775-team8-b2.Netflix.IMBd_movies_ratings` as r
   ON lower(n.title) = lower(r.title)
ORDER BY r.Revenue__Millions_ DESC

In [ ]:
## Distribution of duration for Movies -Hanyu
%%bigquery --project=ba775-team8-b2
SELECT duration_range, COUNT(*) AS num_movies FROM 
(
SELECT CASE 
WHEN CAST(REPLACE(duration,'min','') AS INT64) <40 THEN '0-40'
WHEN CAST(REPLACE(duration,'min','') AS INT64) BETWEEN 40 AND 80 THEN '40-80'
WHEN CAST(REPLACE(duration,'min','') AS INT64) BETWEEN 80 AND 120 THEN '80-120'
WHEN CAST(REPLACE(duration,'min','') AS INT64) BETWEEN 120 AND 160 THEN '120-160'
WHEN CAST(REPLACE(duration,'min','') AS INT64) BETWEEN 160 AND 200 THEN '160-200'
ELSE '200+' END AS duration_range
FROM `ba775-team8-b2.Netflix.netflix_titles`
WHERE type='Movie'
)
GROUP BY duration_range
ORDER BY duration_range ###order???

  duration_range  num_movies
0           0-40         146
1        120-160         874
2        160-200         122
3           200+          15
4          40-80         848
5         80-120        3372

##**Part 3 -** Netflix TV Shows

In [ ]:
%%bigquery --ba775-team8-b2

##**Part 4 -** Trend over time

In [ ]:
## summary of content added by year at Netflix

In [ ]:
%%bigquery --project=ba775-team8-b2
SELECT  RIGHT(date_added, 4) AS year_added,
    COUNT(release_year) as num_content_added
 FROM `ba775-team8-b2.Netflix.netflix_titles`
GROUP BY year_added
HAVING year_added <> 'none'
ORDER BY year_added;

   year_added  num_content_added
0        2008                  2
1        2009                  2
2        2010                  1
3        2011                 13
4        2012                  3
5        2013                 11
6        2014                 25
7        2015                 88
8        2016                443
9        2017               1225
10       2018               1685
11       2019               2153
12       2020               2009
13       2021                117

In [ ]:
## release year trends -- combing two charts for future visual to show content change over time

In [ ]:
%%bigquery --project=ba775-team8-b2
SELECT release_year, COUNT(release_year) AS content_added
FROM `ba775-team8-b2.Netflix.netflix_titles`
GROUP BY release_year
HAVING content_added > 10
ORDER BY content_added DESC;

    release_year  content_added
0           2018           1121
1           2017           1012
2           2019            996
3           2016            882
4           2020            868
5           2015            541
6           2014            334
7           2013            267
8           2012            219
9           2010            173
10          2011            166
11          2009            137
12          2008            125
13          2007             85
14          2006             85
15          2005             73
16          2004             59
17          2003             49
18          2002             45
19          2001             36
20          2000             34
21          1999             33
22          1998             31
23          2021             31
24          1997             30
25          1993             22
26          1990             20
27          1995             19
28          1996             19
29          1992             18
30          1991             17
31          1988             16
32          1994             16
33          1982             15
34          1989             13
35          1979             11

**Type of content trend**

In [12]:
%%bigquery --project=ba775-team8-b2
SELECT release_year, rating as Type_Of_Rating, COUNT(*) as Total_Content FROM `ba775-team8-b2.Netflix.netflix_titles` 
GROUP BY rating, release_year
ORDER BY release_year DESC
# Count of rating each year

     release_year Type_Of_Rating  Total_Content
0            2021              R              1
1            2021           TV-G              2
2            2021           TV-Y              2
3            2021          TV-14              7
4            2021          TV-MA             14
..            ...            ...            ...
432          1944          TV-14              2
433          1944          TV-PG              1
434          1943          TV-PG              3
435          1942          TV-14              2
436          1925          TV-14              1

[437 rows x 3 columns]

In [13]:
%%bigquery --project=ba775-team8-b2
SELECT tb1.release_year, tb1.Max_Content_Count, tb2.Type_Of_Rating 
FROM
(
    SELECT release_year, MAX(Total_Content) as Max_Content_Count 
    FROM (SELECT release_year, rating as Type_Of_Rating, COUNT(*) as Total_Content FROM `ba775-team8-b2.Netflix.netflix_titles` GROUP BY rating, release_year)
    GROUP BY release_year
) as tb1
INNER JOIN (SELECT release_year, rating as Type_Of_Rating, COUNT(*) as Total_Content FROM `ba775-team8-b2.Netflix.netflix_titles` GROUP BY rating, release_year) as tb2
ON tb1.release_year = tb2.release_year
WHERE tb1.Max_Content_Count = tb2.Total_Content
ORDER BY tb1.release_year DESC
# Top rating each year

    release_year  Max_Content_Count Type_Of_Rating
0           2021                 14          TV-MA
1           2020                427          TV-MA
2           2019                499          TV-MA
3           2018                544          TV-MA
4           2017                453          TV-MA
..           ...                ...            ...
93          1945                  2          TV-14
94          1944                  2          TV-14
95          1943                  3          TV-PG
96          1942                  2          TV-14
97          1925                  1          TV-14

[98 rows x 3 columns]

In [ ]:
## content addded by month

In [ ]:
%%bigquery --project=ba775-team8-b2
SELECT month_added, COUNT(*) AS num_content_added FROM 
(
SELECT CASE 
WHEN date_added LIKE 'January%' THEN 'JAN'
WHEN date_added LIKE 'February%' THEN 'FEB'
WHEN date_added LIKE 'March%' THEN 'MAR'
WHEN date_added LIKE 'April%' THEN 'APR'
WHEN date_added LIKE 'May%' THEN 'MAY'
WHEN date_added LIKE 'June%' THEN 'JUN'
WHEN date_added LIKE 'July%' THEN 'JUL'
WHEN date_added LIKE 'August%' THEN 'AUG'
WHEN date_added LIKE 'September%' THEN 'SEP'
WHEN date_added LIKE 'October%' THEN 'OCT'
WHEN date_added LIKE 'November%' THEN 'NOV'
WHEN date_added LIKE 'December%' THEN 'DEC'
END AS month_added
FROM `ba775-team8-b2.Netflix.netflix_titles`
WHERE date_added IS NOT NULL 
)
GROUP BY month_added
HAVING month_added IS NOT NULL 
ORDER BY num_content_added DESC

   month_added  num_content_added
0          DEC                817
1          OCT                780
2          JAN                746
3          NOV                730
4          MAR                661
5          SEP                614
6          AUG                612
7          APR                596
8          JUL                592
9          JUN                538
10         MAY                537
11         FEB                466

##**Part 5 -** Maximizing User Amount / Research Analysis Conclusion

In [ ]:
###PG-13 most profitable movie rating in US theatres - trying to get percent of US movies from library that are PG-13 - code doesnt work any help??

In [ ]:
%%bigquery --project=ba775-team8-b2
SELECT COUNT(Type_of_rating)/COUNT(US_Moives) * 100 AS PG_13_precent
WHERE Type_of_rating = 'PG-13'
FROM 
(
SELECT type, rating as Type_of_rating, COUNT(*) as US_movies
FROM `ba775-team8-b2.Netflix.netflix_titles` 
WHERE country = 'United States'
GROUP BY Type_of_rating, type 
HAVING type = 'Movie'
AND type_of_rating IN ('G', 'PG', 'PG-13', 'R', 'NC-17')
ORDER BY US_movies DESC
)

Executing query with job ID: 4e8592c6-338d-47d1-aeb9-7644bd3238ff
Query executing: 0.30s

ERROR:
 400 Syntax error: Expected end of input but got keyword FROM at [3:1]

(job ID: 4e8592c6-338d-47d1-aeb9-7644bd3238ff)

                     -----Query Job SQL Follows-----

    |    .    |    .    |    .    |    .    |    .    |    .    |
   1:SELECT COUNT(Type_of_rating)/COUNT(US_Moives) * 100 AS PG_13_precent
   2:WHERE Type_of_rating = 'PG-13'
   3:FROM
   4:(
   5:SELECT WHERE type, rating as Type_of_rating, COUNT(*) as US_movies
   6:FROM `ba775-team8-b2.Netflix.netflix_titles`
   7:WHERE country = 'United States'
   8:GROUP BY Type_of_rating, type
   9:HAVING type = 'Movie'
  10:AND type_of_rating IN ('G', 'PG', 'PG-13', 'R', 'NC-17')
  11:ORDER BY US_movies DESC
  12:)
    |    .    |    .    |    .    |    .    |    .    |    .    |

In [ ]:
### 209 million total users , 67 million are in U.S. breakdown of top grossing movie genres in US. need to increase ---- issue getting action to show up in total

In [ ]:
%%bigquery --project=ba775-team8-b2
SELECT Top_grossing_movie_genres, COUNT(*) AS movie_genre_breakdown,  
FROM 
(
SELECT CASE 
WHEN listed_in LIKE '%Adventure%' THEN 'Rank 1: Adventure'
WHEN listed_in LIKE '%Action%' THEN 'Rank 2: Action'
WHEN listed_in LIKE '%Drama%' THEN 'Rank 3: Drama'
WHEN listed_in LIKE '%Comedy%' THEN 'Rank 4: Comedy'
ELSE 'Other Genres' END AS Top_grossing_movie_genres
FROM `ba775-team8-b2.Netflix.netflix_titles`
WHERE type = 'Movie'
AND country = 'United States'
AND listed_in IS NOT NULL
)
GROUP BY Top_grossing_movie_genres
ORDER BY movie_genre_breakdown DESC